ChargePoint/emb-uboot-imx/board/freescale/mx6sabresd_pbc/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

#include "iMX6DP_registers.h"

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif


/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_0 (coord T5), PM_INT_N */
#define BOARD_INITPINS_PM_INT_N_GPIO                                       GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_PM_INT_N_GPIO_PIN                                      0U   /*!< GPIO1 pin index: 0 */
#define BOARD_INITPINS_PM_INT_N_PIN_NAME                                  GPIO_0   /*!< Pin name */
#define BOARD_INITPINS_PM_INT_N_LABEL                                 "PM_INT_N"   /*!< Label */
#define BOARD_INITPINS_PM_INT_N_NAME                                  "PM_INT_N"   /*!< Identifier name */
#define BOARD_INITPINS_PM_INT_N_DIRECTION                kPIN_MUX_DirectionInput   /*!< Direction */

/* GPIO_2 (coord T1), ETH_PWR_EN */
#define BOARD_INITPINS_ETH_PWR_EN_GPIO                                     GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_ETH_PWR_EN_GPIO_PIN                                    2U   /*!< GPIO1 pin index: 2 */
#define BOARD_INITPINS_ETH_PWR_EN_PIN_NAME                                GPIO_2   /*!< Pin name */
#define BOARD_INITPINS_ETH_PWR_EN_LABEL                             "ETH_PWR_EN"   /*!< Label */
#define BOARD_INITPINS_ETH_PWR_EN_NAME                              "ETH_PWR_EN"   /*!< Identifier name */
#define BOARD_INITPINS_ETH_PWR_EN_DIRECTION             kPIN_MUX_DirectionOutput   /*!< Direction */

/* GPIO_3 (coord R7), PHY_RSTn */
#define BOARD_INITPINS_PHY_RSTn_GPIO                                       GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_PHY_RSTn_GPIO_PIN                                      3U   /*!< GPIO1 pin index: 3 */
#define BOARD_INITPINS_PHY_RSTn_PIN_NAME                                  GPIO_3   /*!< Pin name */
#define BOARD_INITPINS_PHY_RSTn_LABEL                                 "PHY_RSTn"   /*!< Label */
#define BOARD_INITPINS_PHY_RSTn_NAME                                  "PHY_RSTn"   /*!< Identifier name */
#define BOARD_INITPINS_PHY_RSTn_DIRECTION               kPIN_MUX_DirectionOutput   /*!< Direction */

/* GPIO_4 (coord R6), SOC_FLOAT_TRIP1 */
#define BOARD_INITPINS_SOC_FLOAT_TRIP1_GPIO                                GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_SOC_FLOAT_TRIP1_GPIO_PIN                               4U   /*!< GPIO1 pin index: 4 */
#define BOARD_INITPINS_SOC_FLOAT_TRIP1_PIN_NAME                           GPIO_4   /*!< Pin name */
#define BOARD_INITPINS_SOC_FLOAT_TRIP1_LABEL                   "SOC_FLOAT_TRIP1"   /*!< Label */
#define BOARD_INITPINS_SOC_FLOAT_TRIP1_NAME                    "SOC_FLOAT_TRIP1"   /*!< Identifier name */
#define BOARD_INITPINS_SOC_FLOAT_TRIP1_DIRECTION         kPIN_MUX_DirectionInput   /*!< Direction */

/* GPIO_5 (coord R4), SOC_FLOAT_TRIP2 */
#define BOARD_INITPINS_SOC_FLOAT_TRIP2_GPIO                                GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_SOC_FLOAT_TRIP2_GPIO_PIN                               5U   /*!< GPIO1 pin index: 5 */
#define BOARD_INITPINS_SOC_FLOAT_TRIP2_PIN_NAME                           GPIO_5   /*!< Pin name */
#define BOARD_INITPINS_SOC_FLOAT_TRIP2_LABEL                   "SOC_FLOAT_TRIP2"   /*!< Label */
#define BOARD_INITPINS_SOC_FLOAT_TRIP2_NAME                    "SOC_FLOAT_TRIP2"   /*!< Identifier name */
#define BOARD_INITPINS_SOC_FLOAT_TRIP2_DIRECTION         kPIN_MUX_DirectionInput   /*!< Direction */

/* GPIO_6 (coord T3), SER_PWR_EN */
#define BOARD_INITPINS_SER_PWR_EN_GPIO                                     GPIO1   /*!< GPIO device name: GPIO1 */
#define BOARD_INITPINS_SER_PWR_EN_GPIO_PIN                                    6U   /*!< GPIO1 pin index: 6 */
#define BOARD_INITPINS_SER_PWR_EN_PIN_NAME                                GPIO_6   /*!< Pin name */
#define BOARD_INITPINS_SER_PWR_EN_LABEL                             "SER_PWR_EN"   /*!< Label */
#define BOARD_INITPINS_SER_PWR_EN_NAME                              "SER_PWR_EN"   /*!< Identifier name */
#define BOARD_INITPINS_SER_PWR_EN_DIRECTION             kPIN_MUX_DirectionOutput   /*!< Direction */

/* GPIO_16 (coord R2), SOC_REED1 */
#define BOARD_INITPINS_SOC_REED1_GPIO                                      GPIO7   /*!< GPIO device name: GPIO7 */
#define BOARD_INITPINS_SOC_REED1_GPIO_PIN                                    11U   /*!< GPIO7 pin index: 11 */
#define BOARD_INITPINS_SOC_REED1_PIN_NAME                                GPIO_16   /*!< Pin name */
#define BOARD_INITPINS_SOC_REED1_LABEL                               "SOC_REED1"   /*!< Label */
#define BOARD_INITPINS_SOC_REED1_NAME                                "SOC_REED1"   /*!< Identifier name */
#define BOARD_INITPINS_SOC_REED1_DIRECTION               kPIN_MUX_DirectionInput   /*!< Direction */

