ChargePoint/emb-uboot-imx/board/freescale/mx6sabresd_pbc/pin_mux.h
/* GPIO_17 (coord R1), SOC_REED2 */
#define BOARD_INITPINS_SOC_REED2_GPIO                                      GPIO7   /*!< GPIO device name: GPIO7 */
#define BOARD_INITPINS_SOC_REED2_GPIO_PIN                                    12U   /*!< GPIO7 pin index: 12 */
#define BOARD_INITPINS_SOC_REED2_PIN_NAME                                GPIO_17   /*!< Pin name */
#define BOARD_INITPINS_SOC_REED2_LABEL                               "SOC_REED2"   /*!< Label */
#define BOARD_INITPINS_SOC_REED2_NAME                                "SOC_REED2"   /*!< Identifier name */
#define BOARD_INITPINS_SOC_REED2_DIRECTION               kPIN_MUX_DirectionInput   /*!< Direction */

/* GPIO_18 (coord P6), SOC_REED3 */
#define BOARD_INITPINS_SOC_REED3_GPIO                                      GPIO7   /*!< GPIO device name: GPIO7 */
#define BOARD_INITPINS_SOC_REED3_GPIO_PIN                                    13U   /*!< GPIO7 pin index: 13 */
#define BOARD_INITPINS_SOC_REED3_PIN_NAME                                GPIO_18   /*!< Pin name */
#define BOARD_INITPINS_SOC_REED3_LABEL                               "SOC_REED3"   /*!< Label */
#define BOARD_INITPINS_SOC_REED3_NAME                                "SOC_REED3"   /*!< Identifier name */
#define BOARD_INITPINS_SOC_REED3_DIRECTION               kPIN_MUX_DirectionInput   /*!< Direction */

/* GPIO_19 (coord P5), SOC_REED4 */
#define BOARD_INITPINS_SOC_REED4_GPIO                                      GPIO4   /*!< GPIO device name: GPIO4 */
#define BOARD_INITPINS_SOC_REED4_GPIO_PIN                                     5U   /*!< GPIO4 pin index: 5 */
#define BOARD_INITPINS_SOC_REED4_PIN_NAME                                GPIO_19   /*!< Pin name */
#define BOARD_INITPINS_SOC_REED4_LABEL                               "SOC_REED4"   /*!< Label */
#define BOARD_INITPINS_SOC_REED4_NAME                                "SOC_REED4"   /*!< Identifier name */
#define BOARD_INITPINS_SOC_REED4_DIRECTION               kPIN_MUX_DirectionInput   /*!< Direction */

/* NANDF_CS0 (coord F15), ACCEL_INT_B */
#define BOARD_INITPINS_ACCEL_INT_B_GPIO                                    GPIO6   /*!< GPIO device name: GPIO6 */
#define BOARD_INITPINS_ACCEL_INT_B_GPIO_PIN                                  11U   /*!< GPIO6 pin index: 11 */
#define BOARD_INITPINS_ACCEL_INT_B_PIN_NAME                            NANDF_CS0   /*!< Pin name */
#define BOARD_INITPINS_ACCEL_INT_B_LABEL                           "ACCEL_INT_B"   /*!< Label */
#define BOARD_INITPINS_ACCEL_INT_B_NAME                            "ACCEL_INT_B"   /*!< Identifier name */
#define BOARD_INITPINS_ACCEL_INT_B_DIRECTION             kPIN_MUX_DirectionInput   /*!< Direction */

/* NANDF_CS1 (coord C16), MAG_INT_B */
#define BOARD_INITPINS_MAG_INT_B_GPIO                                      GPIO6   /*!< GPIO device name: GPIO6 */
#define BOARD_INITPINS_MAG_INT_B_GPIO_PIN                                    14U   /*!< GPIO6 pin index: 14 */
#define BOARD_INITPINS_MAG_INT_B_PIN_NAME                              NANDF_CS1   /*!< Pin name */
#define BOARD_INITPINS_MAG_INT_B_LABEL                               "MAG_INT_B"   /*!< Label */
#define BOARD_INITPINS_MAG_INT_B_NAME                                "MAG_INT_B"   /*!< Identifier name */
#define BOARD_INITPINS_MAG_INT_B_DIRECTION               kPIN_MUX_DirectionInput   /*!< Direction */

/* NANDF_CS2 (coord A17), MAG_DRDY */
#define BOARD_INITPINS_MAG_DRDY_GPIO                                       GPIO6   /*!< GPIO device name: GPIO6 */
#define BOARD_INITPINS_MAG_DRDY_GPIO_PIN                                     15U   /*!< GPIO6 pin index: 15 */
#define BOARD_INITPINS_MAG_DRDY_PIN_NAME                               NANDF_CS2   /*!< Pin name */
#define BOARD_INITPINS_MAG_DRDY_LABEL                                 "MAG_DRDY"   /*!< Label */
#define BOARD_INITPINS_MAG_DRDY_NAME                                  "MAG_DRDY"   /*!< Identifier name */
#define BOARD_INITPINS_MAG_DRDY_DIRECTION                kPIN_MUX_DirectionInput   /*!< Direction */

/* NANDF_CLE (coord C15), SOC_SURGE_DET2 */
#define BOARD_INITPINS_SOC_SURGE_DET2_GPIO                                 GPIO6   /*!< GPIO device name: GPIO6 */
#define BOARD_INITPINS_SOC_SURGE_DET2_GPIO_PIN                                7U   /*!< GPIO6 pin index: 7 */
#define BOARD_INITPINS_SOC_SURGE_DET2_PIN_NAME                         NANDF_CLE   /*!< Pin name */
#define BOARD_INITPINS_SOC_SURGE_DET2_LABEL                     "SOC_SURGE_DET2"   /*!< Label */
#define BOARD_INITPINS_SOC_SURGE_DET2_NAME                      "SOC_SURGE_DET2"   /*!< Identifier name */
#define BOARD_INITPINS_SOC_SURGE_DET2_DIRECTION          kPIN_MUX_DirectionInput   /*!< Direction */

/* NANDF_ALE (coord A16), SOC_SURGE_DET1 */
#define BOARD_INITPINS_SOC_SURGE_DET1_GPIO                                 GPIO6   /*!< GPIO device name: GPIO6 */
#define BOARD_INITPINS_SOC_SURGE_DET1_GPIO_PIN                                8U   /*!< GPIO6 pin index: 8 */
#define BOARD_INITPINS_SOC_SURGE_DET1_PIN_NAME                         NANDF_ALE   /*!< Pin name */
#define BOARD_INITPINS_SOC_SURGE_DET1_LABEL                     "SOC_SURGE_DET1"   /*!< Label */
#define BOARD_INITPINS_SOC_SURGE_DET1_NAME                      "SOC_SURGE_DET1"   /*!< Identifier name */
#define BOARD_INITPINS_SOC_SURGE_DET1_DIRECTION          kPIN_MUX_DirectionInput   /*!< Direction */

/* NANDF_WP_B (coord E15), SOC_SURGE_DET3 */
#define BOARD_INITPINS_SOC_SURGE_DET3_GPIO                                 GPIO6   /*!< GPIO device name: GPIO6 */
#define BOARD_INITPINS_SOC_SURGE_DET3_GPIO_PIN                                9U   /*!< GPIO6 pin index: 9 */
#define BOARD_INITPINS_SOC_SURGE_DET3_PIN_NAME                        NANDF_WP_B   /*!< Pin name */
#define BOARD_INITPINS_SOC_SURGE_DET3_LABEL                     "SOC_SURGE_DET3"   /*!< Label */
#define BOARD_INITPINS_SOC_SURGE_DET3_NAME                      "SOC_SURGE_DET3"   /*!< Identifier name */
#define BOARD_INITPINS_SOC_SURGE_DET3_DIRECTION          kPIN_MUX_DirectionInput   /*!< Direction */

