ChargePoint/emb-uboot-imx/board/freescale/mx6sabresd_pbc/pin_mux.h
/* NANDF_RB0 (coord B16), SOC_SURGE_DET4 */
#define BOARD_INITPINS_SOC_SURGE_DET4_GPIO                                 GPIO6   /*!< GPIO device name: GPIO6 */
#define BOARD_INITPINS_SOC_SURGE_DET4_GPIO_PIN                               10U   /*!< GPIO6 pin index: 10 */
#define BOARD_INITPINS_SOC_SURGE_DET4_PIN_NAME                         NANDF_RB0   /*!< Pin name */
#define BOARD_INITPINS_SOC_SURGE_DET4_LABEL                     "SOC_SURGE_DET4"   /*!< Label */
#define BOARD_INITPINS_SOC_SURGE_DET4_NAME                      "SOC_SURGE_DET4"   /*!< Identifier name */
#define BOARD_INITPINS_SOC_SURGE_DET4_DIRECTION          kPIN_MUX_DirectionInput   /*!< Direction */

/* NANDF_D0 (coord A18), GPIO2_0 */
#define BOARD_INITPINS_GPIO2_0_GPIO                                        GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_GPIO2_0_GPIO_PIN                                       0U   /*!< GPIO2 pin index: 0 */
#define BOARD_INITPINS_GPIO2_0_PIN_NAME                                 NANDF_D0   /*!< Pin name */
#define BOARD_INITPINS_GPIO2_0_LABEL                                   "GPIO2_0"   /*!< Label */
#define BOARD_INITPINS_GPIO2_0_NAME                                    "GPIO2_0"   /*!< Identifier name */
#define BOARD_INITPINS_GPIO2_0_DIRECTION                kPIN_MUX_DirectionOutput   /*!< Direction */

/* NANDF_D1 (coord C17), GPIO2_1 */
#define BOARD_INITPINS_GPIO2_1_GPIO                                        GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_GPIO2_1_GPIO_PIN                                       1U   /*!< GPIO2 pin index: 1 */
#define BOARD_INITPINS_GPIO2_1_PIN_NAME                                 NANDF_D1   /*!< Pin name */
#define BOARD_INITPINS_GPIO2_1_LABEL                                   "GPIO2_1"   /*!< Label */
#define BOARD_INITPINS_GPIO2_1_NAME                                    "GPIO2_1"   /*!< Identifier name */
#define BOARD_INITPINS_GPIO2_1_DIRECTION                kPIN_MUX_DirectionOutput   /*!< Direction */

/* NANDF_D2 (coord F16), GPIO2_2 */
#define BOARD_INITPINS_GPIO2_2_GPIO                                        GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_GPIO2_2_GPIO_PIN                                       2U   /*!< GPIO2 pin index: 2 */
#define BOARD_INITPINS_GPIO2_2_PIN_NAME                                 NANDF_D2   /*!< Pin name */
#define BOARD_INITPINS_GPIO2_2_LABEL                                   "GPIO2_2"   /*!< Label */
#define BOARD_INITPINS_GPIO2_2_NAME                                    "GPIO2_2"   /*!< Identifier name */
#define BOARD_INITPINS_GPIO2_2_DIRECTION                kPIN_MUX_DirectionOutput   /*!< Direction */

/* NANDF_D3 (coord D17), GPIO2_3 */
#define BOARD_INITPINS_GPIO2_3_GPIO                                        GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_GPIO2_3_GPIO_PIN                                       3U   /*!< GPIO2 pin index: 3 */
#define BOARD_INITPINS_GPIO2_3_PIN_NAME                                 NANDF_D3   /*!< Pin name */
#define BOARD_INITPINS_GPIO2_3_LABEL                                   "GPIO2_3"   /*!< Label */
#define BOARD_INITPINS_GPIO2_3_NAME                                    "GPIO2_3"   /*!< Identifier name */
#define BOARD_INITPINS_GPIO2_3_DIRECTION                kPIN_MUX_DirectionOutput   /*!< Direction */

/* NANDF_D4 (coord A19), SOC_SURGE_DET5 */
#define BOARD_INITPINS_SOC_SURGE_DET5_GPIO                                 GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_SOC_SURGE_DET5_GPIO_PIN                                4U   /*!< GPIO2 pin index: 4 */
#define BOARD_INITPINS_SOC_SURGE_DET5_PIN_NAME                          NANDF_D4   /*!< Pin name */
#define BOARD_INITPINS_SOC_SURGE_DET5_LABEL                     "SOC_SURGE_DET5"   /*!< Label */
#define BOARD_INITPINS_SOC_SURGE_DET5_NAME                      "SOC_SURGE_DET5"   /*!< Identifier name */
#define BOARD_INITPINS_SOC_SURGE_DET5_DIRECTION          kPIN_MUX_DirectionInput   /*!< Direction */

/* NANDF_D6 (coord E17), PS2SOC_PG */
#define BOARD_INITPINS_PS2SOC_PG_GPIO                                      GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_PS2SOC_PG_GPIO_PIN                                     6U   /*!< GPIO2 pin index: 6 */
#define BOARD_INITPINS_PS2SOC_PG_PIN_NAME                               NANDF_D6   /*!< Pin name */
#define BOARD_INITPINS_PS2SOC_PG_LABEL                               "PS2SOC_PG"   /*!< Label */
#define BOARD_INITPINS_PS2SOC_PG_NAME                                "PS2SOC_PG"   /*!< Identifier name */
#define BOARD_INITPINS_PS2SOC_PG_DIRECTION               kPIN_MUX_DirectionInput   /*!< Direction */

/* SD4_DAT4 (coord E18), FAN1_SP_CTRL */
#define BOARD_INITPINS_FAN1_SP_CTRL_GPIO                                   GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_FAN1_SP_CTRL_GPIO_PIN                                 12U   /*!< GPIO2 pin index: 12 */
#define BOARD_INITPINS_FAN1_SP_CTRL_PIN_NAME                            SD4_DAT4   /*!< Pin name */
#define BOARD_INITPINS_FAN1_SP_CTRL_LABEL                         "FAN1_SP_CTRL"   /*!< Label */
#define BOARD_INITPINS_FAN1_SP_CTRL_NAME                          "FAN1_SP_CTRL"   /*!< Identifier name */
#define BOARD_INITPINS_FAN1_SP_CTRL_DIRECTION           kPIN_MUX_DirectionOutput   /*!< Direction */

/* SD4_DAT5 (coord C19), FAN2_SP_CTRL */
#define BOARD_INITPINS_FAN2_SP_CTRL_GPIO                                   GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_FAN2_SP_CTRL_GPIO_PIN                                 13U   /*!< GPIO2 pin index: 13 */
#define BOARD_INITPINS_FAN2_SP_CTRL_PIN_NAME                            SD4_DAT5   /*!< Pin name */
#define BOARD_INITPINS_FAN2_SP_CTRL_LABEL                         "FAN2_SP_CTRL"   /*!< Label */
#define BOARD_INITPINS_FAN2_SP_CTRL_NAME                          "FAN2_SP_CTRL"   /*!< Identifier name */
#define BOARD_INITPINS_FAN2_SP_CTRL_DIRECTION           kPIN_MUX_DirectionOutput   /*!< Direction */

/* SD4_DAT6 (coord B20), FAN_TACH_DSP0 */
#define BOARD_INITPINS_FAN_TACH_DSP0_GPIO                                  GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_FAN_TACH_DSP0_GPIO_PIN                                14U   /*!< GPIO2 pin index: 14 */
#define BOARD_INITPINS_FAN_TACH_DSP0_PIN_NAME                           SD4_DAT6   /*!< Pin name */
#define BOARD_INITPINS_FAN_TACH_DSP0_LABEL                       "FAN_TACH_DSP0"   /*!< Label */
#define BOARD_INITPINS_FAN_TACH_DSP0_NAME                        "FAN_TACH_DSP0"   /*!< Identifier name */
#define BOARD_INITPINS_FAN_TACH_DSP0_DIRECTION           kPIN_MUX_DirectionInput   /*!< Direction */

/* SD4_DAT7 (coord D19), FAN_TACH_DSP1 */
#define BOARD_INITPINS_FAN_TACH_DSP1_GPIO                                  GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_FAN_TACH_DSP1_GPIO_PIN                                15U   /*!< GPIO2 pin index: 15 */
#define BOARD_INITPINS_FAN_TACH_DSP1_PIN_NAME                           SD4_DAT7   /*!< Pin name */
#define BOARD_INITPINS_FAN_TACH_DSP1_LABEL                       "FAN_TACH_DSP1"   /*!< Label */
#define BOARD_INITPINS_FAN_TACH_DSP1_NAME                        "FAN_TACH_DSP1"   /*!< Identifier name */
#define BOARD_INITPINS_FAN_TACH_DSP1_DIRECTION           kPIN_MUX_DirectionInput   /*!< Direction */

/* EIM_D16 (coord C25), RTD_DRDYn */
#define BOARD_INITPINS_RTD_DRDYn_GPIO                                      GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_RTD_DRDYn_GPIO_PIN                                    16U   /*!< GPIO3 pin index: 16 */
#define BOARD_INITPINS_RTD_DRDYn_PIN_NAME                                EIM_D16   /*!< Pin name */
#define BOARD_INITPINS_RTD_DRDYn_LABEL                               "RTD_DRDYn"   /*!< Label */
#define BOARD_INITPINS_RTD_DRDYn_NAME                                "RTD_DRDYn"   /*!< Identifier name */
#define BOARD_INITPINS_RTD_DRDYn_DIRECTION               kPIN_MUX_DirectionInput   /*!< Direction */

