ChargePoint/emb-uboot-imx/board/freescale/mx6sabresd_pbc/pin_mux.h
/* EIM_D19 (coord G21), RTD_START_SYNC */
#define BOARD_INITPINS_RTD_START_SYNC_GPIO                                 GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_RTD_START_SYNC_GPIO_PIN                               19U   /*!< GPIO3 pin index: 19 */
#define BOARD_INITPINS_RTD_START_SYNC_PIN_NAME                           EIM_D19   /*!< Pin name */
#define BOARD_INITPINS_RTD_START_SYNC_LABEL                     "RTD_START_SYNC"   /*!< Label */
#define BOARD_INITPINS_RTD_START_SYNC_NAME                      "RTD_START_SYNC"   /*!< Identifier name */
#define BOARD_INITPINS_RTD_START_SYNC_DIRECTION         kPIN_MUX_DirectionOutput   /*!< Direction */

/* EIM_D20 (coord G20), PM_RESET_N */
#define BOARD_INITPINS_PM_RESET_N_GPIO                                     GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_PM_RESET_N_GPIO_PIN                                   20U   /*!< GPIO3 pin index: 20 */
#define BOARD_INITPINS_PM_RESET_N_PIN_NAME                               EIM_D20   /*!< Pin name */
#define BOARD_INITPINS_PM_RESET_N_LABEL                             "PM_RESET_N"   /*!< Label */
#define BOARD_INITPINS_PM_RESET_N_NAME                              "PM_RESET_N"   /*!< Identifier name */
#define BOARD_INITPINS_PM_RESET_N_DIRECTION             kPIN_MUX_DirectionOutput   /*!< Direction */

/* EIM_D23 (coord D25), SOC_THER_SW1 */
#define BOARD_INITPINS_SOC_THER_SW1_GPIO                                   GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_SOC_THER_SW1_GPIO_PIN                                 23U   /*!< GPIO3 pin index: 23 */
#define BOARD_INITPINS_SOC_THER_SW1_PIN_NAME                             EIM_D23   /*!< Pin name */
#define BOARD_INITPINS_SOC_THER_SW1_LABEL                         "SOC_THER_SW1"   /*!< Label */
#define BOARD_INITPINS_SOC_THER_SW1_NAME                          "SOC_THER_SW1"   /*!< Identifier name */
#define BOARD_INITPINS_SOC_THER_SW1_DIRECTION            kPIN_MUX_DirectionInput   /*!< Direction */

/* EIM_D24 (coord F22), SOC_THER_SW2 */
#define BOARD_INITPINS_SOC_THER_SW2_GPIO                                   GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_SOC_THER_SW2_GPIO_PIN                                 24U   /*!< GPIO3 pin index: 24 */
#define BOARD_INITPINS_SOC_THER_SW2_PIN_NAME                             EIM_D24   /*!< Pin name */
#define BOARD_INITPINS_SOC_THER_SW2_LABEL                         "SOC_THER_SW2"   /*!< Label */
#define BOARD_INITPINS_SOC_THER_SW2_NAME                          "SOC_THER_SW2"   /*!< Identifier name */
#define BOARD_INITPINS_SOC_THER_SW2_DIRECTION            kPIN_MUX_DirectionInput   /*!< Direction */

/* EIM_D30 (coord J20), SOC_THER_SW3 */
#define BOARD_INITPINS_SOC_THER_SW3_GPIO                                   GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_SOC_THER_SW3_GPIO_PIN                                 30U   /*!< GPIO3 pin index: 30 */
#define BOARD_INITPINS_SOC_THER_SW3_PIN_NAME                             EIM_D30   /*!< Pin name */
#define BOARD_INITPINS_SOC_THER_SW3_LABEL                         "SOC_THER_SW3"   /*!< Label */
#define BOARD_INITPINS_SOC_THER_SW3_NAME                          "SOC_THER_SW3"   /*!< Identifier name */
#define BOARD_INITPINS_SOC_THER_SW3_DIRECTION            kPIN_MUX_DirectionInput   /*!< Direction */

/* EIM_D31 (coord H21), SOC_THER_SW4 */
#define BOARD_INITPINS_SOC_THER_SW4_GPIO                                   GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_SOC_THER_SW4_GPIO_PIN                                 31U   /*!< GPIO3 pin index: 31 */
#define BOARD_INITPINS_SOC_THER_SW4_PIN_NAME                             EIM_D31   /*!< Pin name */
#define BOARD_INITPINS_SOC_THER_SW4_LABEL                         "SOC_THER_SW4"   /*!< Label */
#define BOARD_INITPINS_SOC_THER_SW4_NAME                          "SOC_THER_SW4"   /*!< Identifier name */
#define BOARD_INITPINS_SOC_THER_SW4_DIRECTION            kPIN_MUX_DirectionInput   /*!< Direction */

/* EIM_D29 (coord J19), PMIC_INT_B */
#define BOARD_INITPINS_PMIC_INT_B_GPIO                                     GPIO3   /*!< GPIO device name: GPIO3 */
#define BOARD_INITPINS_PMIC_INT_B_GPIO_PIN                                   29U   /*!< GPIO3 pin index: 29 */
#define BOARD_INITPINS_PMIC_INT_B_PIN_NAME                               EIM_D29   /*!< Pin name */
#define BOARD_INITPINS_PMIC_INT_B_LABEL                             "PMIC_INT_B"   /*!< Label */
#define BOARD_INITPINS_PMIC_INT_B_NAME                              "PMIC_INT_B"   /*!< Identifier name */
#define BOARD_INITPINS_PMIC_INT_B_DIRECTION              kPIN_MUX_DirectionInput   /*!< Direction */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                                 /*!< Function assigned for the core: Cortex-A9 (Core #0)[ca9_0] */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
